app/controllers/api/v1/products_controller.rb

INSERT INTO "products" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-08-18 00:49:27.958334"], ["updated_at", "2015-08-18 00:49:27.958334"]]
UPDATE "products" SET "user_id" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["user_id", 1], ["updated_at", "2015-08-19 03:26:20.881150"], ["id", 1]]
---
      def create
        product = Product.new(product_params)
        if !product.save
          return render json:{ error: product.errors }, status: 422
        end
        @user.products.push(product)

SELECT  "products".* FROM "products" WHERE "products"."user_id" = ? AND "products"."id" = ? LIMIT 1  [["user_id", 1], ["id", 2]]
UPDATE "products" SET "status" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["status", "activo"], ["updated_at", "2015-08-18 01:10:02.630854"], ["id", 1]]
---
      def update
        product = @user.products.find(params[:id])
          if !product.update(product_update_params)

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 2]]
---
      def destroy
        product = @user.products.find(params[:id])
        if !product.destroy