app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "password", "email", "phone", "age", "created_at", "updated_at", "token") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
      def create
        user = User.new(user_params)
        if user.save

UPDATE "users" SET "age" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["age", 22], ["updated_at", "2015-08-18 02:07:28.268749"], ["id", 1]]
---
      def update
        if !@user.update(user_update_params)